src/Catalogs/КаналыОбсуждений/КаналыОбсуждений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаналыОбсуждений</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательДляСВ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Создал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлФотографии</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.РолиУчастниковКаналовОбсуждений</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>DefinedType.КонтейнерПользователей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/РолиУчастниковКаналовОбсуждений/РолиУчастниковКаналовОбсуждений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиУчастниковКаналовОбсуждений</name>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>Автор</name>
  </enumValues>
  <enumValues>
    <name>Читатель</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЯзыка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВДокументах</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенныеВебСерверы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВПереписке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВПерепискеСРангом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>105</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.ТерриторииИПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/КаналыОбсуждений/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

Перем ЭтоНовый;
Перем ПредыдущиеЗначенияРеквизитов;

#КонецОбласти
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Создал = ТекущийПользователь;
	СтрокаУчастника = Участники.Добавить();
	СтрокаУчастника.Участник = ТекущийПользователь;
	СтрокаУчастника.Роль = Перечисления.РолиУчастниковКаналовОбсуждений.Администратор;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = ЭтоНовый();
	ПредыдущиеЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ПометкаУдаления, Наименование, Участники");
	
	Если ЭтоНовый Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		// Создание пользователя.
		ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
		УстановитьСсылкуНового(Справочники.КаналыОбсуждений.ПолучитьСсылку());
		ОписаниеПользователяИБ.Имя = СтрШаблон(
			"КаналОбсуждений_%1", ПолучитьСсылкуНового().УникальныйИдентификатор());
		ОписаниеПользователяИБ.ПолноеИмя = Наименование;
		ОписаниеПользователяИБ.АутентификацияСтандартная = Истина;
		ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора = Ложь;
		ОписаниеПользователяИБ.Вставить("Действие", "Записать");
		ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", Истина);
		ОписаниеПользователяИБ.ЗапрещеноИзменятьПароль = Истина;
		ОписаниеПользователяИБ.Пароль = Пользователи.СоздатьПароль(8, Истина, "ДляПользователей");;
		ОписаниеПользователяИБ.Роли = Новый Массив;
		ОписаниеПользователяИБ.Роли.Добавить(Метаданные.Роли.ЧатБот.Имя);
		
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Наименование = ОписаниеПользователяИБ.ПолноеИмя;
		НовыйПользователь.Служебный = Истина;
		НовыйПользователь.ДополнительныеСвойства.Вставить(
			"ОписаниеПользователяИБ", ОписаниеПользователяИБ);
		НовыйПользователь.Записать();
		
		ПользовательДляСВ = НовыйПользователь.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Обновление свойств пользователя.
	Если Не ЭтоНовый Тогда
		Если ПометкаУдаления <> ПредыдущиеЗначенияРеквизитов.ПометкаУдаления
			Или Наименование <> ПредыдущиеЗначенияРеквизитов.Наименование Тогда
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.Пользователи");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ПользовательДляСВ);
			Блокировка.Заблокировать();
			ПользовательДляСВОбъект = ПользовательДляСВ.ПолучитьОбъект();
			ПользовательДляСВОбъект.Наименование = Наименование;
			ПользовательДляСВОбъект.Недействителен = ПометкаУдаления;
			ПользовательДляСВОбъект.ПометкаУдаления = ПометкаУдаления;
			Если Наименование <> ПредыдущиеЗначенияРеквизитов.Наименование Тогда
				ОписаниеПользователяИБ = Новый Структура;
				ОписаниеПользователяИБ.Вставить("Действие", "Записать");
				ОписаниеПользователяИБ.Вставить("ПолноеИмя", Наименование);
				ПользовательДляСВОбъект.ДополнительныеСвойства.Вставить(
					"ОписаниеПользователяИБ", ОписаниеПользователяИБ);
			КонецЕсли;
			ПользовательДляСВОбъект.Записать();
		КонецЕсли;
		ОбсужденияДокументооборот.ОбновитьПользователя(ПользовательДляСВ); // Могло измениться фото.
	КонецЕсли;
	
	// Отправка приветственных сообщений для новых авторов и администраторов.
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СтарыеУчастники.Участник КАК Участник,
		|	СтарыеУчастники.Роль КАК Роль
		|ПОМЕСТИТЬ СтарыеУчастники
		|ИЗ
		|	&СтарыеУчастники КАК СтарыеУчастники
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПользователиВКонтейнерах.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ ПользователиИсключения
		|ИЗ
		|	СтарыеУчастники КАК СтарыеУчастники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПользователиВКонтейнерах КАК ПользователиВКонтейнерах
		|		ПО СтарыеУчастники.Участник = ПользователиВКонтейнерах.Контейнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ПриоритетРоли = 1
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РолиУчастниковКаналовОбсуждений.Автор)
		|		КОГДА ВложенныйЗапрос.ПриоритетРоли = 2
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РолиУчастниковКаналовОбсуждений.Администратор)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РолиУчастниковКаналовОбсуждений.Читатель)
		|	КОНЕЦ КАК Роль,
		|	ВложенныйЗапрос.Пользователь КАК Пользователь
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА КаналыОбсужденийУчастники.Роль = ЗНАЧЕНИЕ(Перечисление.РолиУчастниковКаналовОбсуждений.Автор)
		|					ТОГДА 1
		|				КОГДА КаналыОбсужденийУчастники.Роль = ЗНАЧЕНИЕ(Перечисление.РолиУчастниковКаналовОбсуждений.Администратор)
		|					ТОГДА 2
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК ПриоритетРоли,
		|		ПользователиВКонтейнерах.Пользователь КАК Пользователь
		|	ИЗ
		|		Справочник.КаналыОбсуждений.Участники КАК КаналыОбсужденийУчастники
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПользователиВКонтейнерах КАК ПользователиВКонтейнерах
		|			ПО КаналыОбсужденийУчастники.Участник = ПользователиВКонтейнерах.Контейнер
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПользователиИсключения КАК ПользователиИсключения
		|			ПО (ПользователиВКонтейнерах.Пользователь = ПользователиИсключения.Пользователь)
		|	ГДЕ
		|		КаналыОбсужденийУчастники.Ссылка = &Ссылка
		|		И ПользователиИсключения.Пользователь ЕСТЬ NULL
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПользователиВКонтейнерах.Пользователь) КАК ВложенныйЗапрос");
	
	СтарыеУчастники = Участники.ВыгрузитьКолонки();
	Если ПредыдущиеЗначенияРеквизитов.Участники <> Неопределено Тогда
		СтарыеУчастники = ПредыдущиеЗначенияРеквизитов.Участники.Выгрузить();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СтарыеУчастники", СтарыеУчастники);
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Оповещения для добавления в кэш.
	Событие = "ДобавлениеВКанал";
	Параметры = Новый Структура("ИдентификаторСВКанала",
		ОбсужденияДокументооборот.ИдентификаторПользователяСВ(ПользовательДляСВ));
	Пока Выборка.Следующий() Цикл
		ОбсужденияДокументооборот.ОтправитьСлужебноеОповещение(Событие, Выборка.Пользователь, Параметры);
	КонецЦикла;
	
	// Приветственные сообщения.
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		КаналыОбсуждений.ОтправитьПриветственноеСообщение(Ссылка, Выборка.Пользователь, Выборка.Роль);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
